    #  *******временная сложность алгоритмов.********
    #          Алгоритм поиска и сортировки 

# КОНЦЕПЦИЯ Big O (оценка кода)

# Умение видеть и исправлять неоптимальный код

# Ни один серьезный проект , как и ни одна серьезное собеседование 
# не могут обайтись беез вопросов о Big 

# Не  понимание Big O ведет к серьезной потери произвводительности
# ваших алгориитмов
# *************************************
# Оценка сккорости выполнеия

# def pair_sum(a, b): O(1)
#     return a, b

# def pair_sum(n):    O(n) (n-это бесконечность)
#     result = 0
#     for i in range():
#         result += i
#     return result 
# ****************************

    